app/Views/usuario/carrito.php

SELECT *
FROM `productos`
WHERE `productos`.`Id` = '2'
---
                            <?php foreach ($carrito as $item) : ?>
                                <?php
                                    $productoModel = new \App\Models\producto();
                                    $producto = $productoModel->find($item['id']);