app/Controllers/Home.php

        public function inicio(){
            $categoriaModel = new \App\Models\categoria();
            $data['categoria'] = $categoriaModel->findAll();


            $productoModel = new \App\Models\Producto();
             $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `categoria`
SELECT *
FROM `productos`

 public function forpedido()

 {

    $productoModel = new \App\Models\Producto();
    $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `productos`

    public function guardar2(){

        $carrito = $this->session->get('carrito') ?? [];

        // Calcular subtotal, costo de envío y total si es necesario
        $subtotal = 0;
        foreach ($carrito as $item) {
            $subtotal += $item['precio'] * $item['cantidad'];
        }

        if($subtotal>=6000000){

            $costoEnvio = 0;
        } else{
            $costoEnvio = 500000;

        }
        $total = $subtotal + $costoEnvio;

        // Pasa el carrito, subtotal, costo de envío y total a la vista
        $data = [
            'carrito' => $carrito,
            'subtotal' => $subtotal,
            'costoEnvio' => $costoEnvio,
            'total' => $total,
        ];


     $productoModel = new \App\Models\Producto();
     $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `productos`

public function pedidofinal()
{
    $productoModel = new \App\Models\Producto();
    $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `productos`